DataProcessors/ЗагрузкаЗначенийИПЦ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<DataProcessor>
		<Properties>
			<Name>ЗагрузкаЗначенийИПЦ</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Территория</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

InformationRegisters/ЗначенияИПЦ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<InformationRegister>
		<Properties>
			<Name>ЗначенияИПЦ</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Значение</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Территория</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ТерриторияИПЦ</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПериодИПЦ</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

DataProcessors/ЗагрузкаЗначенийИПЦ/Ext/ObjectModule.bsl
Перем ИмяСправочникаССП Экспорт ;
 
Процедура ЗагрузитьДанные(ПолеИсходнойТаблицы, ОтправлятьСообщенияОбОшибке) Экспорт
	НаборЗаписей = РегистрыСведений.ЗначенияИПЦ.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Территория.Установить(ЭтотОбъект.Территория);
	
	Для НомерСтолбца = 2 По ПолеИсходнойТаблицы.ШиринаТаблицы Цикл
		стрГод = ПолеИсходнойТаблицы.Область("R" + Формат(1, "ЧГ=") + "C" + Формат(НомерСтолбца, "ЧГ=")).Текст;
		Для НомерСтроки = 2 По ПолеИсходнойТаблицы.ВысотаТаблицы Цикл
			стрМесяц = строка(НомерСтроки - 1); 
			Если стрДлина(стрМесяц) = 1 Тогда
				стрМесяц = "0" + стрМесяц;
			КонецЕсли;
			
			стрЗначение = ПолеИсходнойТаблицы.Область("R" + Формат(НомерСтроки, "ЧГ=") + "C" + Формат(НомерСтолбца, "ЧГ=")).Текст;
			Попытка
				ЗначениеИПЦ = Число(стрЗначение);
			Исключение
				ЗначениеИПЦ = 0;
			КонецПопытки;
			ПериодИПЦ = Дата(стрГод + стрМесяц + "01");
			
			Если ЗначениеИПЦ > 0 Тогда
				Запись = НаборЗаписей.Добавить();
				Запись.Территория = ЭтотОбъект.Территория;
				Запись.ПериодИПЦ = ПериодИПЦ;
				Запись.Значение = ЗначениеИПЦ;
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
	
	НаборЗаписей.Записать();
КонецПроцедуры
